programming/c/c_snippet.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: C Snippet

* 数据结构

#+CAPTION: 堆栈
#+BEGIN_SRC c
#define MAXVAL 100 // Max depth of stack

int sp = 0;         // Next free stack position
double val[MAXVAL]; // Stack

void push(double f)
{
    if (sp < MAXVAL)
        val[sp++] = f;
    else
        printf("error: stack full, can't push %g\n", f);
}

double pop(void)
{
    if (sp > 0)
        return val[--sp];
    else {
        printf("error: stack empty\n");
        return 0.0;
    }
}
#+END_SRC

* 算法
** 二分查找

#+BEGIN_SRC c
int binarySearch(int x, int v[], int n)
{
    int l = 0, r = n - 1, m;
    while (l <= r) {
        m = (l + r) / 2;
        if (x < v[m])
            r = m - 1;
        else if (x > v[m])
            l = m + 1;
        else
            return m;
    }
    return -1;
}
#+END_SRC

** 快速排序

#+BEGIN_SRC c
void swap(int v[], int i, int j);

void qsort(int v[], int left, int right)
{
    int i, last;

    if (left >= right) // If array contains less than 2 elements
        return;

    // Move pivot to left
    swap(v, left, (left + right) / 2);
    // "last" is separator of lesser/bigger values comparing with pivot
    for (last = left, i = left + 1; i <= right; i++)
        if (v[i] < v[left])
            swap(v, ++last, i);
    // Move pivot back
    swap(v, left, last);

    // Sort recursively
    qsort(v, left, last-1);
    qsort(v, last+1, right);
}

void swap(int v[], int i, int j)
{
    int temp;
    temp = v[i];
    v[i] = v[j];
    v[j] = temp;
}
#+END_SRC

* 计算

#+CAPTION: 乘方
#+BEGIN_SRC c
int power(int base, int power)
{
    int i = 1;
    while (power-- > 0)
        i *= base;
    return i;
}
#+END_SRC

* 文本
** IO

#+CAPTION: 输入字符复制到输出
#+BEGIN_SRC c
int c;
while ((c = getchar()) != EOF)
    putchar(c);
#+END_SRC

#+CAPTION: 输入中获取一行，写入字符数组，返回长度
#+BEGIN_SRC c
int getline(char s[], int lim) // 因为不确定输入的长度，需要设置溢出检查
{
    int c, i;
    for (i = 0; i < lim-1 && (c = getchar()) != EOF && c != '\n'; ++i)
        s[i] = c;
    if (c == '\n')
        s[i++] = c;
    s[i] = '\0';
    return i;
}
#+END_SRC

#+CAPTION: 字符缓冲，支持将暂时不读取的字符退回
#+BEGIN_SRC c
#define BUFSIZE 100

char buf[BUFSIZE];
int bufp = 0; // 缓冲数组的下一个可用位置

int getch(void)
{
    // 缓冲为空时通过 getchar() 读取字符
    return (bufp > 0) ? buf[--bufp] : getchar();
}

void ungetch(int c)
{
    if (bufp >= BUFSIZE)
        printf("ungetch: too many characters\n");
    else
        buf[bufp++] = c;
}
#+END_SRC

#+CAPTION: 十进制数按位输出（递归）
#+BEGIN_SRC c
void printd(int n)
{
    if (n < 0) {
        putchar('-');
        n = -n;
    }
    if (n / 10)
        printd(n / 10);
    putchar(n % 10 + '0');
}
#+END_SRC

