programming/c/c_snippet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C Snippet</title>
<!-- 2016-10-26 周三 20:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">C Snippet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 数据结构</a></li>
<li><a href="#sec-2">2. 算法</a>
<ul>
<li><a href="#sec-2-1">2.1. 二分查找</a></li>
<li><a href="#sec-2-2">2.2. 快速排序</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 计算</a></li>
<li><a href="#sec-4">4. 文本</a>
<ul>
<li><a href="#sec-4-1">4.1. IO</a></li>
<li><a href="#sec-4-2">4.2. 统计</a></li>
<li><a href="#sec-4-3">4.3. 转换</a></li>
<li><a href="#sec-4-4">4.4. 操作</a></li>
<li><a href="#sec-4-5">4.5. 查找</a></li>
<li><a href="#sec-4-6">4.6. 比较</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 位运算</a></li>
<li><a href="#sec-6">6. 日期</a></li>
<li><a href="#sec-7">7. 命令行</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 数据结构</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<label class="org-src-name">堆栈</label>
<pre class="src src-c"><span class="org-preprocessor">#define</span> <span class="org-variable-name">MAXVAL</span> 100 <span class="org-comment-delimiter">// </span><span class="org-comment">Max depth of stack</span>

<span class="org-type">int</span> <span class="org-variable-name">sp</span> = 0;         <span class="org-comment-delimiter">// </span><span class="org-comment">Next free stack position</span>
<span class="org-type">double</span> <span class="org-variable-name">val</span>[MAXVAL]; <span class="org-comment-delimiter">// </span><span class="org-comment">Stack</span>

<span class="org-type">void</span> <span class="org-function-name">push</span>(<span class="org-type">double</span> <span class="org-variable-name">f</span>)
{
    <span class="org-keyword">if</span> (sp &lt; MAXVAL)
        val[sp++] = f;
    <span class="org-keyword">else</span>
        printf(<span class="org-string">"error: stack full, can't push %g\n"</span>, f);
}

<span class="org-type">double</span> <span class="org-function-name">pop</span>(<span class="org-type">void</span>)
{
    <span class="org-keyword">if</span> (sp &gt; 0)
        <span class="org-keyword">return</span> val[--sp];
    <span class="org-keyword">else</span> {
        printf(<span class="org-string">"error: stack empty\n"</span>);
        <span class="org-keyword">return</span> 0.0;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 算法</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 二分查找</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">binarySearch</span>(<span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">v</span>[], <span class="org-type">int</span> <span class="org-variable-name">n</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">l</span> = 0, <span class="org-variable-name">r</span> = n - 1, <span class="org-variable-name">m</span>;
    <span class="org-keyword">while</span> (l &lt;= r) {
        m = (l + r) / 2;
        <span class="org-keyword">if</span> (x &lt; v[m])
            r = m - 1;
        <span class="org-keyword">else</span> <span class="org-keyword">if</span> (x &gt; v[m])
            l = m + 1;
        <span class="org-keyword">else</span>
            <span class="org-keyword">return</span> m;
    }
    <span class="org-keyword">return</span> -1;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 快速排序</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">swap</span>(<span class="org-type">int</span> <span class="org-variable-name">v</span>[], <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-type">int</span> <span class="org-variable-name">j</span>);

<span class="org-type">void</span> <span class="org-function-name">qsort</span>(<span class="org-type">int</span> <span class="org-variable-name">v</span>[], <span class="org-type">int</span> <span class="org-variable-name">left</span>, <span class="org-type">int</span> <span class="org-variable-name">right</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">last</span>;

    <span class="org-keyword">if</span> (left &gt;= right) <span class="org-comment-delimiter">// </span><span class="org-comment">If array contains less than 2 elements</span>
        <span class="org-keyword">return</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Move pivot to left</span>
    swap(v, left, (left + right) / 2);
    <span class="org-comment-delimiter">// </span><span class="org-comment">"last" is separator of lesser/bigger values comparing with pivot</span>
    <span class="org-keyword">for</span> (last = left, i = left + 1; i &lt;= right; i++)
        <span class="org-keyword">if</span> (v[i] &lt; v[left])
            swap(v, ++last, i);
    <span class="org-comment-delimiter">// </span><span class="org-comment">Move pivot back</span>
    swap(v, left, last);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Sort recursively</span>
    qsort(v, left, last-1);
    qsort(v, last+1, right);
}

<span class="org-type">void</span> <span class="org-function-name">swap</span>(<span class="org-type">int</span> <span class="org-variable-name">v</span>[], <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-type">int</span> <span class="org-variable-name">j</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">temp</span>;
    temp = v[i];
    v[i] = v[j];
    v[j] = temp;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 计算</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<label class="org-src-name">乘方</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">power</span>(<span class="org-type">int</span> <span class="org-variable-name">base</span>, <span class="org-type">int</span> <span class="org-variable-name">power</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span> = 1;
    <span class="org-keyword">while</span> (power-- &gt; 0)
        i *= base;
    <span class="org-keyword">return</span> i;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 文本</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> IO</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<label class="org-src-name">输入字符复制到输出</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-variable-name">c</span>;
<span class="org-keyword">while</span> ((c = getchar()) != EOF)
    putchar(c);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">输入中获取一行，写入字符数组，返回长度</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">getline</span>(<span class="org-type">char</span> <span class="org-variable-name">s</span>[], <span class="org-type">int</span> <span class="org-variable-name">lim</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">&#22240;&#20026;&#19981;&#30830;&#23450;&#36755;&#20837;&#30340;&#38271;&#24230;&#65292;&#38656;&#35201;&#35774;&#32622;&#28322;&#20986;&#26816;&#26597;</span>
{
    <span class="org-type">int</span> <span class="org-variable-name">c</span>, <span class="org-variable-name">i</span>;
    <span class="org-keyword">for</span> (i = 0; i &lt; lim-1 &amp;&amp; (c = getchar()) != EOF &amp;&amp; c != <span class="org-string">'\n'</span>; ++i)
        s[i] = c;
    <span class="org-keyword">if</span> (c == <span class="org-string">'\n'</span>)
        s[i++] = c;
    s[i] = <span class="org-string">'\0'</span>;
    <span class="org-keyword">return</span> i;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">字符缓冲，支持将暂时不读取的字符退回</label>
<pre class="src src-c"><span class="org-preprocessor">#define</span> <span class="org-variable-name">BUFSIZE</span> 100

<span class="org-type">char</span> <span class="org-variable-name">buf</span>[BUFSIZE];
<span class="org-type">int</span> <span class="org-variable-name">bufp</span> = 0; <span class="org-comment-delimiter">// </span><span class="org-comment">&#32531;&#20914;&#25968;&#32452;&#30340;&#19979;&#19968;&#20010;&#21487;&#29992;&#20301;&#32622;</span>

<span class="org-type">int</span> <span class="org-function-name">getch</span>(<span class="org-type">void</span>)
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#32531;&#20914;&#20026;&#31354;&#26102;&#36890;&#36807; getchar() &#35835;&#21462;&#23383;&#31526;</span>
    <span class="org-keyword">return</span> (bufp &gt; 0) ? buf[--bufp] : getchar();
}

<span class="org-type">void</span> <span class="org-function-name">ungetch</span>(<span class="org-type">int</span> <span class="org-variable-name">c</span>)
{
    <span class="org-keyword">if</span> (bufp &gt;= BUFSIZE)
        printf(<span class="org-string">"ungetch: too many characters\n"</span>);
    <span class="org-keyword">else</span>
        buf[bufp++] = c;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">十进制数按位输出（递归）</label>
<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">printd</span>(<span class="org-type">int</span> <span class="org-variable-name">n</span>)
{
    <span class="org-keyword">if</span> (n &lt; 0) {
        putchar(<span class="org-string">'-'</span>);
        n = -n;
    }
    <span class="org-keyword">if</span> (n / 10)
        printd(n / 10);
    putchar(n % 10 + <span class="org-string">'0'</span>);
}
</pre>
</div>
</div>
</div>
