programming/c/c_snippet.org
** 统计

#+CAPTION: 返回字符串长度
#+BEGIN_SRC c
// 写法 1
int strlen(char* s)
{
    int i;
    for (i = 0; *s != '\0'; i++, s++);
    return i;
}
// 写法 2
int strlen(char* s)
{
    char* p = s;
    while (*p != '\0')
        p++;
    return p - s;
}
#+END_SRC

#+CAPTION: 统计输入字符数
#+BEGIN_SRC c
int nc;
for (nc = 0; getchar() != EOF; ++nc);
#+END_SRC

#+CAPTION: 统计输入行数
#+BEGIN_SRC c
int c, nl = 0;
while ((c = getchar()) != EOF)
    if (c == '\n') nl++;
#+END_SRC

#+CAPTION: 统计行数、单词数、字符数
#+BEGIN_SRC c
#define IN  1 // 单词内
#define OUT 0 // 单词外

int c, nl, nw, nc, state;
nc = nl = nw = 0;
state = OUT;
while ((c = getchar()) != EOF) {
    ++nc;
    if (c == '\n')
        ++nl;
    if (c == ' ' || c == '\n' || c == '\t')
        state = OUT;
    else if (state == OUT) {
        state = IN;
        ++nw;
    }
}
#+END_SRC

** 转换

#+CAPTION: 字符串转换为整数
#+BEGIN_SRC c
int atoi(char s[])
{
    int i, n, sign;

    // Skip whitespace
    for (i = 0; isspace(s[i]); i++);

    // Get sign and skip sign
    sign = (s[i] == '-') ? -1 : 1;
    if (s[i] == '+' || s[i] == '-')
        i++;

    for (n = 0; isdigit(s[i]); i++)
        n = 10 * n + (s[i] - '0');

    return sign * n;
}
#+END_SRC

#+CAPTION: 整数转换为字符串
#+BEGIN_SRC c
void itoa(int n, char s[])
{
    int i = 0, sign = n;
    if (sign < 0)
        n = -n;
    for (; n > 0; n /= 10)
        s[i++] = n % 10 + '0';
    if (sign < 0)
        s[i++] = '-';
    s[i] = '\0';
    reverse(s); // 倒序
}
#+END_SRC

#+CAPTION: 字符串转换为浮点数
#+BEGIN_SRC c
double atof(char s[])
{
    double val, power;
    int i, sign;

    // Skip whitespace
    for (i = 0; isspace(s[i]); i++);

    // Get sign and skip sign
    sign = (s[i] == '-') ? -1 : 1;
    if (s[i] == '+' || s[i] == '-') i++;

    for (val = 0.0; isdigit(s[i]); i++)
        val = 10.0 * val + (s[i] - '0');

    // Skip decimal point
    if (s[i] == '.') i++;

    for (power = 1.0; isdigit(s[i]); i++) {
        val = 10.0 * val + (s[i] - '0');
        power *= 10;
    }

    return sign * val / power;
}
#+END_SRC

** 操作

#+CAPTION: 复制字符串
#+BEGIN_SRC c
// 指针形式 1
void copy(char* t, char* f)
{
    for (; (*t = *f) != '\0'; t++, f++);
}
// 指针形式 2
void copy(char* t, char* f)
{
    while (*t++ = *f++);
}
// 下标形式
void copy(char* t, char* f)
{
    int i;
    for (i = 0; (t[i] = f[i]) != '\0'; i++);
}
#+END_SRC

#+CAPTION: 字符串倒序
#+BEGIN_SRC c
void reverse(char* s)
{
    int i, j, tmp;
    for (i = 0, j = strlen(s) - 1; i < j; i++, j--)
        tmp = s[i], s[i] = s[j], s[j] = tmp;
}
#+END_SRC

#+CAPTION: 删除末尾的空白字符
#+BEGIN_SRC c
int trim(char s[])
{
    int n;
    for (n = strlen(s)-1; n >= 0; n--)
        if (s[n] != ' ' && s[n] != '\t' && s[n] != '\n')
            break; // 从后向前找到第一个非空白字符
    s[n+1] = '\0'; // 将之后的内容截断
    return n;
}
#+END_SRC

** 查找

#+CAPTION: 查找子字符串，返回起始位置
#+BEGIN_SRC c
int strindex(char s[], char t[])
{
    int i, j, k;
    for (i = 0; s[i] != '\0'; i++) {
        for (j=i, k=0; t[k] != '\0' && s[j] == t[k]; j++, k++);
        if (k > 0 && t[k] == '\0')
            return i;
    }
    return -1;
}
#+END_SRC

