programming/c/c_snippet.html
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 统计</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<label class="org-src-name">返回字符串长度</label>
<pre class="src src-c"><span class="org-comment-delimiter">// </span><span class="org-comment">&#20889;&#27861; 1</span>
<span class="org-type">int</span> <span class="org-function-name">strlen</span>(<span class="org-type">char</span>* <span class="org-variable-name">s</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>;
    <span class="org-keyword">for</span> (i = 0; *s != <span class="org-string">'\0'</span>; i++, s++);
    <span class="org-keyword">return</span> i;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">&#20889;&#27861; 2</span>
<span class="org-type">int</span> <span class="org-function-name">strlen</span>(<span class="org-type">char</span>* <span class="org-variable-name">s</span>)
{
    <span class="org-type">char</span>* <span class="org-variable-name">p</span> = s;
    <span class="org-keyword">while</span> (*p != <span class="org-string">'\0'</span>)
        p++;
    <span class="org-keyword">return</span> p - s;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">统计输入字符数</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-variable-name">nc</span>;
<span class="org-keyword">for</span> (nc = 0; getchar() != EOF; ++nc);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">统计输入行数</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-variable-name">c</span>, <span class="org-variable-name">nl</span> = 0;
<span class="org-keyword">while</span> ((c = getchar()) != EOF)
    <span class="org-keyword">if</span> (c == <span class="org-string">'\n'</span>) nl++;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">统计行数、单词数、字符数</label>
<pre class="src src-c"><span class="org-preprocessor">#define</span> <span class="org-variable-name">IN</span>  1 <span class="org-comment-delimiter">// </span><span class="org-comment">&#21333;&#35789;&#20869;</span>
<span class="org-preprocessor">#define</span> <span class="org-variable-name">OUT</span> 0 <span class="org-comment-delimiter">// </span><span class="org-comment">&#21333;&#35789;&#22806;</span>

<span class="org-type">int</span> <span class="org-variable-name">c</span>, <span class="org-variable-name">nl</span>, <span class="org-variable-name">nw</span>, <span class="org-variable-name">nc</span>, <span class="org-variable-name">state</span>;
nc = nl = nw = 0;
state = OUT;
<span class="org-keyword">while</span> ((c = getchar()) != EOF) {
    ++nc;
    <span class="org-keyword">if</span> (c == <span class="org-string">'\n'</span>)
        ++nl;
    <span class="org-keyword">if</span> (c == <span class="org-string">' '</span> || c == <span class="org-string">'\n'</span> || c == <span class="org-string">'\t'</span>)
        state = OUT;
    <span class="org-keyword">else</span> <span class="org-keyword">if</span> (state == OUT) {
        state = IN;
        ++nw;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 转换</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<label class="org-src-name">字符串转换为整数</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">atoi</span>(<span class="org-type">char</span> <span class="org-variable-name">s</span>[])
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">n</span>, <span class="org-variable-name">sign</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Skip whitespace</span>
    <span class="org-keyword">for</span> (i = 0; isspace(s[i]); i++);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Get sign and skip sign</span>
    sign = (s[i] == <span class="org-string">'-'</span>) ? -1 : 1;
    <span class="org-keyword">if</span> (s[i] == <span class="org-string">'+'</span> || s[i] == <span class="org-string">'-'</span>)
        i++;

    <span class="org-keyword">for</span> (n = 0; isdigit(s[i]); i++)
        n = 10 * n + (s[i] - <span class="org-string">'0'</span>);

    <span class="org-keyword">return</span> sign * n;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">整数转换为字符串</label>
<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">itoa</span>(<span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">char</span> <span class="org-variable-name">s</span>[])
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span> = 0, <span class="org-variable-name">sign</span> = n;
    <span class="org-keyword">if</span> (sign &lt; 0)
        n = -n;
    <span class="org-keyword">for</span> (; n &gt; 0; n /= 10)
        s[i++] = n % 10 + <span class="org-string">'0'</span>;
    <span class="org-keyword">if</span> (sign &lt; 0)
        s[i++] = <span class="org-string">'-'</span>;
    s[i] = <span class="org-string">'\0'</span>;
    reverse(s); <span class="org-comment-delimiter">// </span><span class="org-comment">&#20498;&#24207;</span>
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">字符串转换为浮点数</label>
<pre class="src src-c"><span class="org-type">double</span> <span class="org-function-name">atof</span>(<span class="org-type">char</span> <span class="org-variable-name">s</span>[])
{
    <span class="org-type">double</span> <span class="org-variable-name">val</span>, <span class="org-variable-name">power</span>;
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">sign</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Skip whitespace</span>
    <span class="org-keyword">for</span> (i = 0; isspace(s[i]); i++);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Get sign and skip sign</span>
    sign = (s[i] == <span class="org-string">'-'</span>) ? -1 : 1;
    <span class="org-keyword">if</span> (s[i] == <span class="org-string">'+'</span> || s[i] == <span class="org-string">'-'</span>) i++;

    <span class="org-keyword">for</span> (val = 0.0; isdigit(s[i]); i++)
        val = 10.0 * val + (s[i] - <span class="org-string">'0'</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">Skip decimal point</span>
    <span class="org-keyword">if</span> (s[i] == <span class="org-string">'.'</span>) i++;

    <span class="org-keyword">for</span> (power = 1.0; isdigit(s[i]); i++) {
        val = 10.0 * val + (s[i] - <span class="org-string">'0'</span>);
        power *= 10;
    }

    <span class="org-keyword">return</span> sign * val / power;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 操作</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<label class="org-src-name">复制字符串</label>
<pre class="src src-c"><span class="org-comment-delimiter">// </span><span class="org-comment">&#25351;&#38024;&#24418;&#24335; 1</span>
<span class="org-type">void</span> <span class="org-function-name">copy</span>(<span class="org-type">char</span>* <span class="org-variable-name">t</span>, <span class="org-type">char</span>* <span class="org-variable-name">f</span>)
{
    <span class="org-keyword">for</span> (; (*t = *f) != <span class="org-string">'\0'</span>; t++, f++);
}
<span class="org-comment-delimiter">// </span><span class="org-comment">&#25351;&#38024;&#24418;&#24335; 2</span>
<span class="org-type">void</span> <span class="org-function-name">copy</span>(<span class="org-type">char</span>* <span class="org-variable-name">t</span>, <span class="org-type">char</span>* <span class="org-variable-name">f</span>)
{
    <span class="org-keyword">while</span> (*t++ = *f++);
}
<span class="org-comment-delimiter">// </span><span class="org-comment">&#19979;&#26631;&#24418;&#24335;</span>
<span class="org-type">void</span> <span class="org-function-name">copy</span>(<span class="org-type">char</span>* <span class="org-variable-name">t</span>, <span class="org-type">char</span>* <span class="org-variable-name">f</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>;
    <span class="org-keyword">for</span> (i = 0; (t[i] = f[i]) != <span class="org-string">'\0'</span>; i++);
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">字符串倒序</label>
<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">reverse</span>(<span class="org-type">char</span>* <span class="org-variable-name">s</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">j</span>, <span class="org-variable-name">tmp</span>;
    <span class="org-keyword">for</span> (i = 0, j = strlen(s) - 1; i &lt; j; i++, j--)
        tmp = s[i], s[i] = s[j], s[j] = tmp;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">删除末尾的空白字符</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">trim</span>(<span class="org-type">char</span> <span class="org-variable-name">s</span>[])
{
    <span class="org-type">int</span> <span class="org-variable-name">n</span>;
    <span class="org-keyword">for</span> (n = strlen(s)-1; n &gt;= 0; n--)
        <span class="org-keyword">if</span> (s[n] != <span class="org-string">' '</span> &amp;&amp; s[n] != <span class="org-string">'\t'</span> &amp;&amp; s[n] != <span class="org-string">'\n'</span>)
            <span class="org-keyword">break</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#20174;&#21518;&#21521;&#21069;&#25214;&#21040;&#31532;&#19968;&#20010;&#38750;&#31354;&#30333;&#23383;&#31526;</span>
    s[n+1] = <span class="org-string">'\0'</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#23558;&#20043;&#21518;&#30340;&#20869;&#23481;&#25130;&#26029;</span>
    <span class="org-keyword">return</span> n;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 查找</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<label class="org-src-name">查找子字符串，返回起始位置</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">strindex</span>(<span class="org-type">char</span> <span class="org-variable-name">s</span>[], <span class="org-type">char</span> <span class="org-variable-name">t</span>[])
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">j</span>, <span class="org-variable-name">k</span>;
    <span class="org-keyword">for</span> (i = 0; s[i] != <span class="org-string">'\0'</span>; i++) {
        <span class="org-keyword">for</span> (j=i, k=0; t[k] != <span class="org-string">'\0'</span> &amp;&amp; s[j] == t[k]; j++, k++);
        <span class="org-keyword">if</span> (k &gt; 0 &amp;&amp; t[k] == <span class="org-string">'\0'</span>)
            <span class="org-keyword">return</span> i;
    }
    <span class="org-keyword">return</span> -1;
}
</pre>
</div>
</div>
</div>
