programming/c/c_snippet.org
** 比较

#+BEGIN_SRC c
// 指针形式
int strcmp(char *s, char *t)
{
    for (; *s == *t; s++, t++)
        if (*s == '\0')
            return 0;
    return *s - *t;
}
// 下标形式
int strcmp(char *s, char *t)
{
    int i;
    for (i = 0; s[i] == t[i]; i++)
        if (s[i] == '\0')
            return 0;
    return s[i] - t[i];
}
#+END_SRC

* 位运算

#+CAPTION: 计数二进制位中 =1= 的个数
#+BEGIN_SRC c
int bitcount(unsigned x)
{
    int b = 0;
    for (; x != 0; x >>= 1)
        if (x & 01) b++;
    return b;
}
#+END_SRC

#+CAPTION: 从比特位 =p= （索引值，最右一位为 =0=）开始取 =n= 位
#+BEGIN_SRC c
unsigned getbits(unsigned x, int p, int n)
{
    return (x >> (p+1-n)) & ~(~0 << n);
}
#+END_SRC

* 日期

#+CAPTION: 输入年月日，计算该日期是当年的第几天
#+BEGIN_SRC c
static int monthDays[2][13] = {
    {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
    {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
};
int dayOfYear(int year, int month, int day)
{
    int i, leap;
    leap = (year%4 == 0 && year%100 != 0 || year%400 == 0);
    for (i = 1; i < month; i++)
        day += monthDays[leap][i];
    return day;
}
#+END_SRC

#+CAPTION: 输入年和当年的第几天，计算月和日
#+BEGIN_SRC c
static int monthDays[2][13] = {
    {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
    {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
};
void monthDay(int year, int nthDay, int* month, int* day)
{
    int i, leap;
    leap = (year%4 == 0 && year%100 != 0 || year%400 == 0);
    for (i = 1; nthDay > monthDays[leap][i]; i++)
        nthDay -= monthDays[leap][i];
    *month = i;
    *day = nthDay;
}
#+END_SRC

* 命令行

#+CAPTION: 读取命令行参数
#+BEGIN_SRC c
int main(int argc, char* argv[])
{
    int c, optionA = 0, optionB = 0;

    while (--argc > 0 && (*++argv)[0] == '-') {
        // Options can be combined: -ab
        while (c = *++argv[0]) {
            switch (c) {
                case 'a':
                    optionA = 1;
                    break;
                case 'b':
                    optionB = 1;
                    break;
                default:
                    // Error
                    break;
            }
        }
    }
    ...
}
#+END_SRC
