programming/c/c_snippet.html
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 比较</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">

<pre class="src src-c"><span class="org-comment-delimiter">// </span><span class="org-comment">&#25351;&#38024;&#24418;&#24335;</span>
<span class="org-type">int</span> <span class="org-function-name">strcmp</span>(<span class="org-type">char</span> *<span class="org-variable-name">s</span>, <span class="org-type">char</span> *<span class="org-variable-name">t</span>)
{
    <span class="org-keyword">for</span> (; *s == *t; s++, t++)
        <span class="org-keyword">if</span> (*s == <span class="org-string">'\0'</span>)
            <span class="org-keyword">return</span> 0;
    <span class="org-keyword">return</span> *s - *t;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">&#19979;&#26631;&#24418;&#24335;</span>
<span class="org-type">int</span> <span class="org-function-name">strcmp</span>(<span class="org-type">char</span> *<span class="org-variable-name">s</span>, <span class="org-type">char</span> *<span class="org-variable-name">t</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>;
    <span class="org-keyword">for</span> (i = 0; s[i] == t[i]; i++)
        <span class="org-keyword">if</span> (s[i] == <span class="org-string">'\0'</span>)
            <span class="org-keyword">return</span> 0;
    <span class="org-keyword">return</span> s[i] - t[i];
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 位运算</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<label class="org-src-name">计数二进制位中 <code>1</code> 的个数</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">bitcount</span>(<span class="org-type">unsigned</span> <span class="org-variable-name">x</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">b</span> = 0;
    <span class="org-keyword">for</span> (; x != 0; x &gt;&gt;= 1)
        <span class="org-keyword">if</span> (x &amp; 01) b++;
    <span class="org-keyword">return</span> b;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">从比特位 <code>p</code> （索引值，最右一位为 <code>0=）开始取 =n</code> 位</label>
<pre class="src src-c"><span class="org-type">unsigned</span> <span class="org-function-name">getbits</span>(<span class="org-type">unsigned</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">p</span>, <span class="org-type">int</span> <span class="org-variable-name">n</span>)
{
    <span class="org-keyword">return</span> (x &gt;&gt; (p+1-n)) &amp; ~(~0 &lt;&lt; n);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 日期</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<label class="org-src-name">输入年月日，计算该日期是当年的第几天</label>
<pre class="src src-c"><span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">monthDays</span>[2][13] = {
    {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
    {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
};
<span class="org-type">int</span> <span class="org-function-name">dayOfYear</span>(<span class="org-type">int</span> <span class="org-variable-name">year</span>, <span class="org-type">int</span> <span class="org-variable-name">month</span>, <span class="org-type">int</span> <span class="org-variable-name">day</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">leap</span>;
    leap = (year%4 == 0 &amp;&amp; year%100 != 0 || year%400 == 0);
    <span class="org-keyword">for</span> (i = 1; i &lt; month; i++)
        day += monthDays[leap][i];
    <span class="org-keyword">return</span> day;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">输入年和当年的第几天，计算月和日</label>
<pre class="src src-c"><span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">monthDays</span>[2][13] = {
    {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
    {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
};
<span class="org-type">void</span> <span class="org-function-name">monthDay</span>(<span class="org-type">int</span> <span class="org-variable-name">year</span>, <span class="org-type">int</span> <span class="org-variable-name">nthDay</span>, <span class="org-type">int</span>* <span class="org-variable-name">month</span>, <span class="org-type">int</span>* <span class="org-variable-name">day</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">leap</span>;
    leap = (year%4 == 0 &amp;&amp; year%100 != 0 || year%400 == 0);
    <span class="org-keyword">for</span> (i = 1; nthDay &gt; monthDays[leap][i]; i++)
        nthDay -= monthDays[leap][i];
    *month = i;
    *day = nthDay;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 命令行</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<label class="org-src-name">读取命令行参数</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span>* <span class="org-variable-name">argv</span>[])
{
    <span class="org-type">int</span> <span class="org-variable-name">c</span>, <span class="org-variable-name">optionA</span> = 0, <span class="org-variable-name">optionB</span> = 0;

    <span class="org-keyword">while</span> (--argc &gt; 0 &amp;&amp; (*++argv)[0] == <span class="org-string">'-'</span>) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">Options can be combined: -ab</span>
        <span class="org-keyword">while</span> (c = *++argv[0]) {
            <span class="org-keyword">switch</span> (c) {
                <span class="org-keyword">case</span> <span class="org-string">'a'</span>:
                    optionA = 1;
                    <span class="org-keyword">break</span>;
                <span class="org-keyword">case</span> <span class="org-string">'b'</span>:
                    optionB = 1;
                    <span class="org-keyword">break</span>;
                <span class="org-keyword">default</span>:
                    <span class="org-comment-delimiter">// </span><span class="org-comment">Error</span>
                    <span class="org-keyword">break</span>;
            }
        }
    }
    ...
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-10-26 周三 20:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
